print('Задача 6')

a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))
print('Сумма: ', a % 100 + b % 100)


# Реализуйте программу,
# которая запрашивает два числа у пользователя.
# После этого у каждого числа возьмите две последние цифры.
# Получившиеся два числа сложите и выведите на экран.

# Пример: 
# Введите первое число: 456
# Введите второе число: 123
# Сумма: 79