print('Задача 4. Площадь треугольника')

a = int(input('Введите первый катет: '))
b = int(input('Введите второй катет: '))
s = (a * b) / 2
print('Площадь треугольника равна: ', s)


# Напишите программу,
# которая запрашивает у пользователя длины двух катетов
# в прямоугольном треугольнике и выводит его площадь.

# Формула: 
# S = ab/2
